## Staging: elasticache
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 5 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                    |
|--------|---------------------------------------------------------------------------|
| add    | `aws_elasticache_parameter_group.cra_upd_elasticache_param_group`         |
|        | `aws_elasticache_replication_group.cra_upd_elasticache_replication_group` |
|        | `aws_elasticache_subnet_group.cra_upd_elasticache_subnet_group`           |
|        | `aws_security_group.cra_upd_elasticache_egress_sg`                        |
|        | `aws_security_group.cra_upd_elasticache_sg`                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_parameter_group.cra_upd_elasticache_param_group will be created
  + resource "aws_elasticache_parameter_group" "cra_upd_elasticache_param_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "valkey7"
      + id          = (known after apply)
      + name        = "cra-upd-elasticache-param-group"
      + tags_all    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }

      + parameter {
          + name  = "maxmemory-policy"
          + value = "noeviction"
        }
    }

  # aws_elasticache_replication_group.cra_upd_elasticache_replication_group will be created
  + resource "aws_elasticache_replication_group" "cra_upd_elasticache_replication_group" {
      + apply_immediately              = true
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = "true"
      + auth_token_update_strategy     = "ROTATE"
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + cluster_mode                   = "disabled"
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "UPD Elasticache Replication Group"
      + engine                         = "valkey"
      + engine_version                 = "7.2"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + ip_discovery                   = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + network_type                   = (known after apply)
      + node_type                      = "cache.t4g.micro"
      + num_cache_clusters             = 1
      + num_node_groups                = (known after apply)
      + parameter_group_name           = "cra-upd-elasticache-param-group"
      + port                           = 6379
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_id           = "cra-upd-elasticache-rep-group"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = "cra-upd-elasticache-subnet-group"
      + tags_all                       = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + transit_encryption_enabled     = false
      + transit_encryption_mode        = (known after apply)
    }

  # aws_elasticache_subnet_group.cra_upd_elasticache_subnet_group will be created
  + resource "aws_elasticache_subnet_group" "cra_upd_elasticache_subnet_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "cra-upd-elasticache-subnet-group"
      + subnet_ids  = [
          + "subnet-03abf6f758a19e9a0",
          + "subnet-0b0b8a64cf98261c7",
        ]
      + tags_all    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id      = (known after apply)
    }

  # aws_security_group.cra_upd_elasticache_egress_sg will be created
  + resource "aws_security_group" "cra_upd_elasticache_egress_sg" {
      + arn                    = (known after apply)
      + description            = "Allow egress to ElastiCache"
      + egress                 = [
          + {
              + cidr_blocks      = []
              + description      = "Allow egress to ElastiCache"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 6379
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "cra-upd-elasticache-egress-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0fffaf0067d0706de"
    }

  # aws_security_group.cra_upd_elasticache_sg will be created
  + resource "aws_security_group" "cra_upd_elasticache_sg" {
      + arn                    = (known after apply)
      + description            = "ElastiCache Security Group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow ingress from the VPC to ElastiCache"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = "cra-upd-elasticache-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "staging"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-0fffaf0067d0706de"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + elasticache_egress_sg_id = (known after apply)
  + elasticache_endpoint     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_parameter_group.cra_upd_elasticache_param_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_replication_group.cra_upd_elasticache_replication_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.cra_upd_elasticache_subnet_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_elasticache_egress_sg"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.cra_upd_elasticache_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
